In [1]:
import numpy as np;
import matplotlib.pyplot as plt;    
import pandas as pd;

In [7]:
df = pd.read_csv('50_Startups.csv')
print('shape of df is: ',df.shape)
print('\n\ndf null sum: \n',df.isnull().sum())
print('\n\ndf null mean percentage; \n',df.isnull().mean()*100)
df.head()

shape of df is:  (50, 5)


df null sum:
 R&D Spend          0
Administration     0
Marketing Spend    0
State              0
Profit             0
dtype: int64


df null mean percentage;
 R&D Spend          0.0
Administration     0.0
Marketing Spend    0.0
State              0.0
Profit             0.0
dtype: float64

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [15]:
df = np.round(pd.read_csv('50_Startups.csv')[['R&D Spend','Administration','Marketing Spend','Profit']]/10000)
df = df.sample(5)
df

    R&D Spend  Administration  Marketing Spend  Profit
36        3.0            13.0             20.0     9.0
31        6.0            15.0              9.0    10.0
26        8.0            14.0             13.0    11.0
29        7.0            15.0             11.0    10.0
0        17.0            14.0             47.0    19.0

In [16]:
df = df.iloc[:,0:-1]
df

    R&D Spend  Administration  Marketing Spend
36        3.0            13.0             20.0
31        6.0            15.0              9.0
26        8.0            14.0             13.0
29        7.0            15.0             11.0
0        17.0            14.0             47.0

In [18]:
df.iloc[1,0] = np.nan
df.iloc[3,1] = np.nan
df.iloc[-1,-1] = np.nan
df

C:\Users\AMAN CHOUDHARY\AppData\Local\Temp\ipykernel_19204\502887573.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.iloc[1,0] = np.nan
C:\Users\AMAN CHOUDHARY\AppData\Local\Temp\ipykernel_19204\502887573.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.iloc[3,1] = np.nan
C:\Users\AMAN CHOUDHARY\AppData\Local\Temp\ipykernel_19204\502887573.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.iloc[-1,-1] = np.nan

    R&D Spend  Administration  Marketing Spend
36        3.0            13.0             20.0
31        NaN            15.0              9.0
26        8.0            14.0             13.0
29        7.0             NaN             11.0
0        17.0            14.0              NaN

### **Step 1 - Impute all missing values with mean of respective col**

In [ ]:
df0 = pd.DataFrame()
df0['R&D Spend'] = df['R&D Spend'].fillna(df['R&D Spend'].mean())
df0['Administration'] = df['Administration'].fillna(df['Administration'].mean())
df0['Marketing Spend'] = df['Marketing Spend'].fillna(df['Marketing Spend'].mean())

    R&D Spend  Administration  Marketing Spend
36       3.00            13.0            20.00
31       8.75            15.0             9.00
26       8.00            14.0            13.00
29       7.00            14.0            11.00
0       17.00            14.0            13.25

In [24]:
# 0th iteration
df0

    R&D Spend  Administration  Marketing Spend
36       3.00            13.0            20.00
31       8.75            15.0             9.00
26       8.00            14.0            13.00
29       7.00            14.0            11.00
0       17.00            14.0            13.25

In [27]:
# Remove the col1 imputed value
df1 = df0.copy()
df1.iloc[1,0] = np.nan;
df1

    R&D Spend  Administration  Marketing Spend
36        3.0            13.0            20.00
31        NaN            15.0             9.00
26        8.0            14.0            13.00
29        7.0            14.0            11.00
0        17.0            14.0            13.25

In [31]:
# Use first 3 rows to build a model and use the last for prediction

X = df1.iloc[[0,2,3,4],1:3]
X

    Administration  Marketing Spend
36            13.0            20.00
26            14.0            13.00
29            14.0            11.00
0             14.0            13.25

In [33]:
y = df1.iloc[[0,2,3,4],0]
y

36     3.0
26     8.0
29     7.0
0     17.0
Name: R&D Spend, dtype: float64

In [35]:
df1

    R&D Spend  Administration  Marketing Spend
36        3.0            13.0            20.00
31        NaN            15.0             9.00
26        8.0            14.0            13.00
29        7.0            14.0            11.00
0        17.0            14.0            13.25

In [36]:
from sklearn.linear_model import LinearRegression
reg = LinearRegression()
reg.fit(X,y)
y_pred = reg.predict(df1.iloc[[1],1:3])
df1.iloc[1,0] = 30.55
y_pred

array([30.54794521])

In [38]:
df1

    R&D Spend  Administration  Marketing Spend
36       3.00            13.0            20.00
31      30.55            15.0             9.00
26       8.00            14.0            13.00
29       7.00            14.0            11.00
0       17.00            14.0            13.25

In [40]:
# now remove the col2 imputed value
df1.iloc[3,1] = np.nan
df1

    R&D Spend  Administration  Marketing Spend
36       3.00            13.0            20.00
31      30.55            15.0             9.00
26       8.00            14.0            13.00
29       7.00             NaN            11.00
0       17.00            14.0            13.25

In [43]:
X = df1.iloc[[0,1,2,4], [0,2]]
y = df1.iloc[[0,1,2,4],1]
y

36    13.0
31    15.0
26    14.0
0     14.0
Name: Administration, dtype: float64

In [45]:
lr = LinearRegression()
lr.fit(X,y)
y_pred = lr.predict(df1.iloc[[3],[0,2]])
df1.iloc[3,1] = 14.211
y_pred

array([14.21142975])

In [47]:
df1

    R&D Spend  Administration  Marketing Spend
36       3.00          13.000            20.00
31      30.55          15.000             9.00
26       8.00          14.000            13.00
29       7.00          14.211            11.00
0       17.00          14.000            13.25

In [48]:
# remove the col3 imputed value
df1.iloc[4,2] = np.nan
df1

    R&D Spend  Administration  Marketing Spend
36       3.00          13.000             20.0
31      30.55          15.000              9.0
26       8.00          14.000             13.0
29       7.00          14.211             11.0
0       17.00          14.000              NaN

In [54]:
X = df1.iloc[0:4, 0:2]
y = df1.iloc[0:4,2]
X

    R&D Spend  Administration
36       3.00          13.000
31      30.55          15.000
26       8.00          14.000
29       7.00          14.211

In [59]:
df1.iloc[[4],0:2]

   R&D Spend  Administration
0       17.0            14.0

In [62]:
lr = LinearRegression()
lr.fit(X,y)
y_pred = lr.predict(df1.iloc[[4],0:2])
df1.iloc[4,2] = 14.55
df1

    R&D Spend  Administration  Marketing Spend
36       3.00          13.000            20.00
31      30.55          15.000             9.00
26       8.00          14.000            13.00
29       7.00          14.211            11.00
0       17.00          14.000            14.55

In [63]:
# after 1st iteration
df1

    R&D Spend  Administration  Marketing Spend
36       3.00          13.000            20.00
31      30.55          15.000             9.00
26       8.00          14.000            13.00
29       7.00          14.211            11.00
0       17.00          14.000            14.55

In [65]:
# Subtract 0th iteration from 1st iteration

df1 - df0

    R&D Spend  Administration  Marketing Spend
36        0.0           0.000              0.0
31       21.8           0.000              0.0
26        0.0           0.000              0.0
29        0.0           0.211              0.0
0         0.0           0.000              1.3

In [66]:
# do this iteration again until the difference is very small